In [12]:
#load pandas package
import pandas as pd

In [13]:
#create dataframe
saudi_arabia=pd.DataFrame({
    'city':['riyadh','jeddah','dammam'],
    'temp':[45,43,47],
    'pop_m' :[5,4.5,3]
})

In [14]:
#create dataframe
us=pd.DataFrame({
    'city':['new york','chicago','olrlando'],
    'temp':[23,16,27],
    'pop_m':[30,40,27]
    
})

In [17]:
#use concat on the two dataframes
df=pd.concat([saudi_arabia,us],ignore_index=True)

In [18]:
df

       city  temp  pop_m
0    riyadh    45    5.0
1    jeddah    43    4.5
2    dammam    47    3.0
3  new york    23   30.0
4   chicago    16   40.0
5  olrlando    27   27.0

In [24]:
df=pd.concat([saudi_arabia,us],keys=['saudi_arabia','united_state'])
df

                    city  temp  pop_m
saudi_arabia 0    riyadh    45    5.0
             1    jeddah    43    4.5
             2    dammam    47    3.0
united_state 0  new york    23   30.0
             1   chicago    16   40.0
             2  olrlando    27   27.0